

Функция ОткрытьФормуЗагрузкиИзТаблиц(СтруктураПараметров, ВладелецФормы, ОписаниеОповещенияВозврата) Экспорт
	
	Форма = ОткрытьФорму("Обработка.ЗагрузкаДанныхИзТаблиц.Форма", СтруктураПараметров, ВладелецФормы, , , , ОписаниеОповещенияВозврата);
	Возврат Форма;
		
КонецФункции

#Область ПрограммныйИнтерфейс 

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтруктураКолонкиДляЗагрузкиТаблиц() Экспорт
	Возврат Новый Структура("Имя, Тип, Представление, Примечание, ОбязательнаДляЗаполнения, ПоЧемуИскать, ЗагрузкаКолонкиОбязательна");
КонецФункции // СтруктураКолонкиДляЗагрузкиТаблиц() 

#КонецОбласти