
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавляемыеРеквизиты = Новый Массив;
	УдаляемыеРеквизиты = Новый Массив;

	Если ПустаяСтрока(Параметры.Заголовок) Тогда
		ВызватьИсключение НСтр("ru='Предусмотрено открытие обработки только из форм объектов.'");
	КонецЕсли;
	
	ЭтаФорма.Заголовок = Параметры.Заголовок;
	
	Если ЗначениеЗаполнено(Параметры.Колонки) тогда 
		
		МассивКолонок = Новый Массив;
		МассивНаименованийКолонок = Новый Массив;
		
		Позиция = 1;
		Для Каждого Колонка Из Параметры.Колонки Цикл 
			Если Колонка.Свойство("ЗагрузкаКолонкиОбязательна") Тогда         //Для того чтобы вносить изменения только в допустимые колонки
				НоваяНастройкиРедактированияКолонок = НастройкаРедактированияКолонок.Добавить();
				НоваяНастройкиРедактированияКолонок.НаименованиеКолонки =  Колонка.Представление;
				НоваяНастройкиРедактированияКолонок.ЗагрузкаКолонкиОбязательна = Колонка.ЗагрузкаКолонкиОбязательна;
				Если Колонка.ЗагрузкаКолонкиОбязательна = Истина тогда 
					НоваяНастройкиРедактированияКолонок.ВыборПользователя = Истина; 
				Иначе
					НоваяНастройкиРедактированияКолонок.ВыборПользователя = Ложь;
				КонецЕсли; 
				
				Если МассивНаименованийКолонок.Найти("ЗагрузкаКолонкиОбязательна") = Неопределено тогда
					НовыйРеквизит = Новый РеквизитФормы("ЗагрузкаКолонкиОбязательна", Новый ОписаниеТипов("Булево"), "ИнформацияПоКолонкам"); 
					ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
					ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
					ДобавляемыеРеквизиты.Очистить();
					МассивНаименованийКолонок.Добавить("ЗагрузкаКолонкиОбязательна");
				КонецЕсли;
            КонецЕсли;
			
			Если Колонка.Свойство("ИмяРеквизитаЗаполнения") Тогда         //Для того чтобы искать по нескольким колонкам одно значение
				НоваяСтрокаПоискаОдного = ТаблицаКолонокПоискаОдного.Добавить();
				НоваяСтрокаПоискаОдного.ИмяКолонки = Колонка.ИмяРеквизитаЗаполнения;
				НоваяСтрокаПоискаОдного.Позиция = Позиция;
				ИмяРеквизитаТаблицы = Колонка.ИмяРеквизитаЗаполнения;
			Иначе 
				ИмяРеквизитаТаблицы = Колонка.Имя;
			КонецЕсли;                                                    
			
			Если МассивНаименованийКолонок.Найти(ИмяРеквизитаТаблицы) = Неопределено Тогда
				НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаТаблицы, Колонка.Тип, "ТаблицаРезультат", Колонка.Представление);
				МассивКолонок.Добавить(НовыйРеквизит);
				МассивНаименованийКолонок.Добавить(ИмяРеквизитаТаблицы);
			КонецЕсли;
			
			Если Колонка.Свойство("СтруктураСтатичныхРеквизитовПоиска") Тогда     //Для определения в колонке поска статичных параметров в запросе "ГДЕ"
				Для каждого ПолеСтруктуры Из Колонка.СтруктураСтатичныхРеквизитовПоиска Цикл
					НоваяСтрокаТаблицы = ТаблицаСтатичныхРеквизитовПоиска.Добавить();
					НоваяСтрокаТаблицы.ИмяКолонки = Колонка.Имя;
					НоваяСтрокаТаблицы.ПолеПоиска = ПолеСтруктуры.Ключ;
					НоваяСтрокаТаблицы.ЗначениеРеквизита = ПолеСтруктуры.Значение;
				КонецЦикла;
			КонецЕсли;
			
			Если Колонка.Свойство("СписокИсключаемыхЗначений") Тогда
				Если Колонка.СписокИсключаемыхЗначений.Количество() > 0 Тогда
					НоваяСтрокаТаблицы = ТаблицаИсключенийЗначений.Добавить();
					НоваяСтрокаТаблицы.ИмяКолонки = Колонка.Имя;
					НоваяСтрокаТаблицы.СписокИсключаемыхЗначений = Колонка.СписокИсключаемыхЗначений;
				КонецЕсли;
			КонецЕсли;
			
			
			КолонкаМакета = ИнформацияПоКолонкам.Добавить();
			КолонкаМакета.ИмяКолонки = Колонка.Имя;
			КолонкаМакета.ПредставлениеКолонки = Колонка.Представление;
			КолонкаМакета.ТипКолонки = Колонка.Тип;
			КолонкаМакета.ОбязательнаДляЗаполнения = Колонка.ОбязательнаДляЗаполнения; 
			КолонкаМакета.Позиция = Позиция; 
			КолонкаМакета.Примечание = Колонка.Примечание;
			Если Колонка.Свойство("ЗагрузкаКолонкиОбязательна") Тогда  
				КолонкаМакета.ЗагрузкаКолонкиОбязательна = Истина; 
			КонецЕсли;
			Если Колонка.Свойство("ПоЧемуИскать") И Колонка.ПоЧемуИскать <> Неопределено Тогда
				КолонкаМакета.ПоЧемуИскать = Колонка.ПоЧемуИскать;
			КонецЕсли;
			Если (Колонка.Тип = Новый ОписаниеТипов("Булево") или Колонка.Тип = Новый ОписаниеТипов("Число")) и НЕ Колонка.Свойство("Ширина") тогда
				КолонкаМакета.Ширина = 10;  	
			Иначе
				Колонка.Свойство("Ширина", КолонкаМакета.Ширина);  
			КонецЕсли;
			Если Колонка.Свойство("ДопКолонкиДляПоиска") Тогда
				Для Каждого СтрДопКолонкиДляПоиска Из Колонка.ДопКолонкиДляПоиска Цикл
					НоваяСтрокаТаблицы = ТаблицаДопКолонокДляПоиска.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, СтрДопКолонкиДляПоиска);
				КонецЦикла;
			КонецЕсли;
			Позиция = Позиция + 1;
		КонецЦикла;
		
		НовыйРеквизит = Новый РеквизитФормы("ПометкаУдаления", Новый ОписаниеТипов("Булево"), "ТаблицаРезультат", "Пометка удаления");
		МассивКолонок.Добавить(НовыйРеквизит);
		
		Шапка = Обработки.ЗагрузкаДанныхИзТаблиц.ШапкаБланкаДляЗаполненияПоИнформацииПоКолонкам(ИнформацияПоКолонкам);
		ШаблонСДанными.Вывести(Шапка);
		
		ИзменитьРеквизиты(МассивКолонок);
		Для Каждого Колонка Из Параметры.Колонки Цикл
			Если Колонка.Свойство("ИмяРеквизитаЗаполнения") Тогда
				Если Элементы.Найти("ТаблицаРезультат" + Колонка.ИмяРеквизитаЗаполнения) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ИмяКолонкиЭлемента = Колонка.ИмяРеквизитаЗаполнения;
			Иначе
				ИмяКолонкиЭлемента = Колонка.Имя;
			КонецЕсли;
			КолонкаЗагружается = Истина;
			Если Элементы.Найти("ТаблицаРезультат" + ИмяКолонкиЭлемента) = Неопределено  Тогда
				Эл = Элементы.Добавить("ТаблицаРезультат" + ИмяКолонкиЭлемента, Тип("ПолеФормы"), Элементы.ТаблицаРезультат);
				Эл.Вид = ВидПоляФормы.ПолеВвода;
				Эл.ПутьКДанным = "ТаблицаРезультат." + ИмяКолонкиЭлемента;
				Эл.Подсказка = Колонка.Примечание;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ТабличныйДокумент") Тогда
		ТабличныйДокумент = Параметры.ТабличныйДокумент;
		ОбластьВставки = ТабличныйДокумент.Область(1,1,ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы);
		ОбластьПриемник = ШаблонСДанными.Область(2,1,ТабличныйДокумент.ВысотаТаблицы + 1, ТабличныйДокумент.ШиринаТаблицы);
		ШаблонСДанными.ВставитьОбласть(ОбластьВставки,ОбластьПриемник);
	КонецЕсли;
	
	Если Параметры.Свойство("ОтключатьВидимостьПодменюСервис") Тогда
		ЭлементСервис = ЭтаФорма.Элементы.Найти("ПодменюСервис");
		Если ЭлементСервис <> Неопределено Тогда
			ЭлементСервис.Видимость = Не Параметры.ОтключатьВидимостьПодменюСервис;
		КонецЕсли;
	КонецЕсли;
	Если Параметры.Свойство("УчитыватьВсеДубли") Тогда
		УчитыватьВсеДубли = Параметры.УчитыватьВседубли;
	КонецЕсли;
	Если Параметры.Свойство("ОписаниеМенеджераДополнительныхРеквизитовФормы") Тогда
		Менеджер = Новый (Параметры.ОписаниеМенеджераДополнительныхРеквизитовФормы);
		Менеджер.ПодготовитьФормуЗагрузкиИзТаблиц(ЭтаФорма);
	КонецЕсли;
	Если Параметры.Свойство("ИгнорироватьДубли") Тогда
		ИгнорироватьДубли = Параметры.ИгнорироватьДубли;
	КонецЕсли;
	
	ДоступностьРедактированияКолонок();
КонецПроцедуры 

&НаСервере
Процедура ДоступностьРедактированияКолонок()
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	Если НастройкаРедактированияКолонок.Количество() = 0 тогда
		Элементы.НастройкиКолонок.Доступность = Ложь; 
	КонецЕсли;
КонецПроцедуры

#Область Страница1

&НаКлиенте
Процедура ШаблонСДаннымиПриАктивизации(Элемент)
	Элемент.Защита = ?(Элемент.ТекущаяОбласть.Верх > 1, Ложь, Истина);
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере()
	ШаблонСДанными.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = ""; 
	Фильтр = "Табличный документ (*.xls;*.xlsx)|*.xls;*.xlsx"; 
	Диалог.Фильтр = Фильтр; 
	Диалог.МножественныйВыбор = Ложь;	
	Диалог.Показать(Новый ОписаниеОповещения("ЗагрузитьФайлЗавершение", ЭтаФорма, Новый Структура("Диалог", Диалог)));		
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ПутьКФайлу = ДополнительныеПараметры.Диалог.ПолноеИмяФайла; 
	
	Если (ВыбранныеФайлы = Неопределено) Тогда					
		ОбщегоНазначенияКлиент.СообщитьПользователю("Файл не выбран");	
	Иначе
		Попытка
			Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКФайлу), ЭтаФорма.УникальныйИдентификатор);
			ПрочитатьФайл(ПутьКФайлу, Адрес);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ОбщегоНазначенияКлиент.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ПрочитатьФайл(Путь, АдресВоВременномХранилище) Экспорт
	
	ШаблонСДанными.Очистить();
	Шапка = Обработки.ЗагрузкаДанныхИзТаблиц.ШапкаБланкаДляЗаполненияПоИнформацииПоКолонкам(ИнформацияПоКолонкам);
	ШаблонСДанными.Вывести(Шапка);
	
	Расширение = Прав(Путь,4);
	Расширение = СтрЗаменить(Расширение, ".", "");
	
	ФайлПриемник = ПолучитьИмяВременногоФайла(Расширение);
	ДанныеХранилища = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	ДанныеХранилища.Записать(ФайлПриемник);
	
	ТаблДок = Новый ТабличныйДокумент;
	ТаблДок.Прочитать(ФайлПриемник);
	
	ОбластьТаблицы = ТаблДок.Область(1, 1, ТаблДок.ВысотаТаблицы, ТаблДок.ШиринаТаблицы);
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьТаблицы);  
	ПостроительЗапроса.Выполнить();
	
	ТЗ = ПостроительЗапроса.Результат.Выгрузить();
	НераспознанныеКолонки = Новый Массив();
	НомерСтрокиШаблона = 2;
	Для каждого Строка из ТЗ цикл
		Для НомерКолонкиШаблона = 1 По ШаблонСДанными.ШиринаТаблицы Цикл 		
			Ячейка = ШаблонСДанными.Область(НомерСтрокиШаблона, НомерКолонкиШаблона, НомерСтрокиШаблона, НомерКолонкиШаблона);
			НайденнаяКолонка = НайтиИнформациюОКолонке(ИнформацияПоКолонкам, "Позиция", НомерКолонкиШаблона);
			ИмяКолонки = НайденнаяКолонка.ИмяКолонки; 
			ПредставлениеКолонки = НайденнаяКолонка.ПредставлениеКолонки;
			Если ТЗ.Колонки.Найти(ИмяКолонки) <> Неопределено Тогда	
				Ячейка.Текст = Строка[ИмяКолонки];
			ИначеЕсли ТЗ.Колонки.Найти(ПредставлениеКолонки) <> Неопределено тогда
				Ячейка.Текст = Строка[ПредставлениеКолонки];
			Иначе
				Если НераспознанныеКолонки.Найти(ПредставлениеКолонки) = Неопределено тогда 
					НераспознанныеКолонки.Добавить(ПредставлениеКолонки);  
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;  
		НомерСтрокиШаблона = НомерСтрокиШаблона + 1;
	КонецЦикла;
	
	Если НераспознанныеКолонки.Количество() > 0 тогда
		Для каждого ИмяКолонки из НераспознанныеКолонки цикл 
			ОбщегоНазначения.СообщитьПользователю("В файле не найдена колонка """ + ИмяКолонки +  """");
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура Распознать(Команда)
	
	РаспознатьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура РаспознатьНаСервере()
	
	ДобавляемыеРеквизиты = Новый Массив;
	УдаляемыеРеквизиты = Новый Массив;
	ТаблицаНеНайденных.Очистить();
	ТаблицаНеуникальных.Очистить();
	СтрокиУдалены = Ложь;
	
	ОписаниеТипаЧисло  = Новый ОписаниеТипов("Число");
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	КэшЗначений = Новый Соответствие;
	
	ЗагружаемыеДанные = Новый ТаблицаЗначений;
	ЗагружатьКолонку = Истина;
	Для каждого Колонка Из ИнформацияПоКолонкам Цикл
		Если Колонка.ТипКолонки = Неопределено Тогда
			ТипКолонки = ОписаниеТипаСтрока;
		Иначе
			ТипКолонки = Колонка.ТипКолонки;
		КонецЕсли;
		ЗагружаемыеДанные.Колонки.Добавить(Колонка.ИмяКолонки, ТипКолонки, Колонка.ПредставлениеКолонки); 
		
		КэшЗначений.Вставить(Колонка.ИмяКолонки, Новый Соответствие);
	КонецЦикла;
		
	ЗагружаемыеДанные.Колонки.Добавить("Идентификатор",                ОписаниеТипаЧисло,  "Идентификатор");
	ЗагружаемыеДанные.Колонки.Добавить("РезультатСопоставленияСтроки", ОписаниеТипаСтрока, "Результат");
	ЗагружаемыеДанные.Колонки.Добавить("ОписаниеОшибки",               ОписаниеТипаСтрока, "Причина");
	
	Для Сч = 2 По ШаблонСДанными.ВысотаТаблицы Цикл
		НоваяСтрока = ЗагружаемыеДанные.Добавить();
	КонецЦикла;
	
	МассивНомеровОбработанныхКолонок = Новый Массив;
	МассивПовторяющихсяКолонок = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаКолонокПоискаОдного, "ИмяКолонки", Истина);
	
	Для каждого ИмяКолонкиПоискаОдного Из МассивПовторяющихсяКолонок Цикл
		НайденныеСтроки = ТаблицаКолонокПоискаОдного.НайтиСтроки(Новый Структура("ИмяКолонки", ИмяКолонкиПоискаОдного));
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			МассивНомеровОбработанныхКолонок.Добавить(НайденнаяСтрока.Позиция);
		КонецЦикла;
		НайтиЗначенияКолонокОдногоТипа(МассивНомеровОбработанныхКолонок, ЗагружаемыеДанные);
	КонецЦикла;
	
	Для НомерКолонки = 1 По ШаблонСДанными.ШиринаТаблицы Цикл
		Если МассивНомеровОбработанныхКолонок.Найти(НомерКолонки) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НайденнаяКолонка = НайтиИнформациюОКолонке(ИнформацияПоКолонкам, "Позиция", НомерКолонки);
		Если НайденнаяКолонка <> Неопределено Тогда
			ТипКолонки = НайденнаяКолонка.ТипКолонки.Типы()[0];
			ИмяКолонки = НайденнаяКолонка.ИмяКолонки;
			Если НайденнаяКолонка.Свойство("ЗагрузкаКолонкиОбязательна") Тогда
				НайденНастройка = НастройкаРедактированияКолонок.НайтиСтроки(Новый Структура("НаименованиеКолонки",  НайденнаяКолонка.ПредставлениеКолонки));
				Если НайденНастройка[0].ВыборПользователя = Ложь тогда
					ЗагружатьКолонку = Ложь; 
					Если Элементы.Найти("ТаблицаРезультат" + ИмяКолонки) <> Неопределено тогда
						УдаляемыеРеквизиты.Добавить("ТаблицаРезультат." + ИмяКолонки);
						Элементы.Удалить(Элементы.Найти("ТаблицаРезультат" + ИмяКолонки)); 
						ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
						УдаляемыеРеквизиты.Очистить();
					КонецЕсли;
				Иначе
					ЗагружатьКолонку = Истина;
					Если Элементы.Найти("ТаблицаРезультат" + ИмяКолонки) = Неопределено тогда
						Если ТипКолонки = Тип("Строка") ИЛИ ТипКолонки = Тип("Число") ИЛИ ТипКолонки = Тип("Дата") ИЛИ ТипКолонки = Тип("Булево") Тогда
							НовыйРеквизит = Новый РеквизитФормы(ИмяКолонки, Новый ОписаниеТипов(""+ТипКолонки), "ТаблицаРезультат"); 
						Иначе
							ПолноеИмяОбъекта = Метаданные.НайтиПоТипу(ТипКолонки).ПолноеИмя(); 
							ПолноеИмяОбъекта = СтрЗаменить(ПолноеИмяОбъекта,".","Ссылка.");
							НовыйРеквизит = Новый РеквизитФормы(ИмяКолонки, Новый ОписаниеТипов(ПолноеИмяОбъекта), "ТаблицаРезультат", НайденнаяКолонка.ПредставлениеКолонки); 	
						КонецЕсли;
						ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
						ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
						ДобавляемыеРеквизиты.Очистить();
						Эл = Элементы.Добавить("ТаблицаРезультат" + ИмяКолонки, Тип("ПолеФормы"), Элементы.ТаблицаРезультат);
						Эл.Вид = ВидПоляФормы.ПолеВвода;
						Эл.ПутьКДанным = "ТаблицаРезультат." + ИмяКолонки;
						Эл.Подсказка = НайденнаяКолонка.ПредставлениеКолонки;
						Эл.Заголовок = НайденнаяКолонка.ПредставлениеКолонки;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если (ТипКолонки = Тип("Строка") ИЛИ ТипКолонки = Тип("Число") ИЛИ ТипКолонки = Тип("Дата") ИЛИ ТипКолонки = Тип("Булево")) и ЗагружатьКолонку = Истина Тогда
				ЗаполнитьКолонкуЭлементарногоТипа(НайденнаяКолонка, ЗагружаемыеДанные, КэшЗначений[ИмяКолонки]); 
			ИначеЕсли ЗагружатьКолонку = Истина тогда 
				ПолноеИмяОбъекта = Метаданные.НайтиПоТипу(ТипКолонки).ПолноеИмя();
				ОписаниеОбъекта = РазложитьПолноеИмяОбъекта(ПолноеИмяОбъекта);
				Если ОписаниеОбъекта.ТипОбъекта = "Перечисление" Тогда
					ОтработатьПеречисление(ОписаниеОбъекта, НайденнаяКолонка, ЗагружаемыеДанные);
				Иначе
					НайтиЗначенияКолонки(НайденнаяКолонка.Позиция, ЗагружаемыеДанные);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);

	ПоказатьНеуникальные();
	ЗагружаемыеДанные.Колонки.Добавить("ПометкаУдаления", Новый ОписаниеТипов("Булево"));
	СвернутьМножествоЗагрузитьВРезультат(ЗагружаемыеДанные);
	
	Если ТаблицаНеНайденных.Количество() > 0 Тогда
		ТаблицаНеНайденных.Сортировать("НомерСтроки");
		ПоказатьНенайденные();
	Иначе
		Элементы.Страницы.ТекущаяСтраница = Элементы.РаспознанныеДанные;
	КонецЕсли;
КонецПроцедуры

Функция НайтиИнформациюОКолонке(ТаблицаИнформацияПоКолонкам, ИмяКолонки, Значение)
		
	Отбор = Новый Структура(ИмяКолонки, Значение);
	НайденныеКолонки = ТаблицаИнформацияПоКолонкам.НайтиСтроки(Отбор);
	Колонка = Неопределено;
	Если НайденныеКолонки.Количество() > 0 Тогда 
		Колонка = НайденныеКолонки[0];
	КонецЕсли;
	
	Возврат Колонка;                                                              
	
КонецФункции

&НаСервере
Функция НайтиВКэшеИлиРаспознатьЭлементарныйТип(Значение, ТипКолонки, КэшЗначенийКолонки) 
	
	Если КэшЗначенийКолонки[Значение] <> Неопределено тогда
		Возврат КэшЗначенийКолонки[Значение];
	Иначе
		Для каждого Тип Из ТипКолонки.Типы() Цикл	
			Если Тип = Тип("Строка") тогда 
				ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
				Результат = ОписаниеТипаСтрока.ПривестиЗначение(Значение); 
				КэшЗначенийКолонки.Вставить(Значение, Результат); 
				Возврат Результат;	
			ИначеЕсли Тип = Тип("Число") Тогда
				НецифровыеСимволы = СтрСоединить(СтрРазделить(Значение, "1234567890,.-"));
				Значение = СтрСоединить(СтрРазделить(Значение, НецифровыеСимволы));
				ОписаниеТипаЧисло = Новый ОписаниеТипов("Число"); 
				Результат = ОписаниеТипаЧисло.ПривестиЗначение(Значение);
				КэшЗначенийКолонки.Вставить(Значение, Результат);
				Возврат Результат;
			ИначеЕсли Тип = Тип("Дата") Тогда 
				Результат = СтроковыеФункцииКлиентСервер.СтрокаВДату(Значение, ТипКолонки.КвалификаторыДаты.ЧастиДаты);
				КэшЗначенийКолонки.Вставить(Значение, Результат);
				Возврат Результат;
			ИначеЕсли Тип = Тип("Булево") Тогда	
				ОписаниеТипаБулево = Новый ОписаниеТипов("Булево"); 
				Результат = ОписаниеТипаБулево.ПривестиЗначение(Значение);
				КэшЗначенийКолонки.Вставить(Значение, Результат);
				Возврат Результат;	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецФункции // ПолучитьЗначениеКолонки()

Функция НайтиЗначениеНеЭлементарногоТипа(Типы, ЗначениеЯчейки, КэшЗначенийКолонки)
	
	
	ДанныеЯчейки = "";
	Для каждого ТипДанных Из Типы Цикл
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипДанных);
		
		Если ОбъектМетаданных = Неопределено Тогда
			Продолжить;
		КонецЕсли;     
		
		ОписаниеОбъекта = РазложитьПолноеИмяОбъекта(ОбъектМетаданных.ПолноеИмя());
		Если ОписаниеОбъекта.ТипОбъекта = "Справочник" Тогда
			Если НЕ ОбъектМетаданных.Автонумерация И ОбъектМетаданных.ДлинаКода > 0 Тогда 
				ДанныеЯчейки = Справочники[ОписаниеОбъекта.НазваниеОбъекта].НайтиПоКоду(ЗначениеЯчейки, Истина);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ДанныеЯчейки) Тогда 
				ДанныеЯчейки = Справочники[ОписаниеОбъекта.НазваниеОбъекта].НайтиПоНаименованию(ЗначениеЯчейки, Истина);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ДанныеЯчейки) Тогда 
				ДанныеЯчейки = Справочники[ОписаниеОбъекта.НазваниеОбъекта].НайтиПоКоду(ЗначениеЯчейки, Истина);
			КонецЕсли;
		ИначеЕсли ОписаниеОбъекта.ТипОбъекта = "Документ" Тогда	
			ДанныеЯчейки = Документы[ОписаниеОбъекта.НазваниеОбъекта].НайтиПоНомеру(ЗначениеЯчейки);
		ИначеЕсли ОписаниеОбъекта.ТипОбъекта = "Перечисление" Тогда 
			Для каждого ЗначениеПеречисления Из Перечисления[ОписаниеОбъекта.НазваниеОбъекта] Цикл 
				Если Строка(ЗначениеПеречисления) = СокрЛП(ЗначениеЯчейки) Тогда 
					ДанныеЯчейки = ЗначениеПеречисления; 
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ОписаниеОбъекта.ТипОбъекта = "ПланСчетов" Тогда
			ДанныеЯчейки = ПланыСчетов[ОписаниеОбъекта.НазваниеОбъекта].НайтиПоКоду(ЗначениеЯчейки);
			Если ДанныеЯчейки.Пустая() Тогда 
				ДанныеЯчейки = ПланыСчетов[ОписаниеОбъекта.НазваниеОбъекта].НайтиПоНаименованию(ЗначениеЯчейки, Истина);
			КонецЕсли;
		ИначеЕсли ОписаниеОбъекта.ТипОбъекта = "ПланВидовХарактеристик" Тогда
			Если НЕ ОбъектМетаданных.Автонумерация И ОбъектМетаданных.ДлинаКода > 0 Тогда 
				ДанныеЯчейки = ПланыВидовХарактеристик[ОписаниеОбъекта.НазваниеОбъекта].НайтиПоКоду(ЗначениеЯчейки, Истина);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ДанныеЯчейки) Тогда 
				ДанныеЯчейки = ПланыВидовХарактеристик[ОписаниеОбъекта.НазваниеОбъекта].НайтиПоНаименованию(ЗначениеЯчейки, Истина);
			КонецЕсли;
		Иначе
			ДанныеЯчейки =  Строка(ЗначениеЯчейки);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеЯчейки) Тогда 
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	КэшЗначенийКолонки.Вставить(ЗначениеЯчейки, ДанныеЯчейки);
	
	Возврат ДанныеЯчейки;
	
КонецФункции

// Возвращает имя объекта в виде структуры.
//
// Параметры:
//  ПолноеИмяОбъекта - Строка
//  
// Возвращаемое значение:
//  Структура:
//    * ТипОбъекта - Строка - тип объекта.
//    * НазваниеОбъекта - Строка - название объекта.
//    * ИмяТабличнойЧасти - Строка - имя табличной части.
//
Функция РазложитьПолноеИмяОбъекта(ПолноеИмяОбъекта) Экспорт
	
	Результат = СтрРазделить(ПолноеИмяОбъекта, ".", Ложь);
	
	ИмяОбъекта = Новый Структура;
	ИмяОбъекта.Вставить("ПолноеИмяОбъекта", ПолноеИмяОбъекта);
	ИмяОбъекта.Вставить("ТипОбъекта");
	ИмяОбъекта.Вставить("НазваниеОбъекта");
	ИмяОбъекта.Вставить("ИмяТабличнойЧасти");
	
	Если Результат.Количество() = 2 Тогда
		Если Результат[0] = "Документ" ИЛИ Результат[0] = "Справочник" ИЛИ Результат[0] = "БизнесПроцесс" 
			ИЛИ Результат[0] = "Перечисление" ИЛИ Результат[0] = "ПланВидовХарактеристик"
			ИЛИ Результат[0] = "ПланСчетов" Тогда
			ИмяОбъекта.ТипОбъекта = Результат[0];
			ИмяОбъекта.НазваниеОбъекта = Результат[1];
		Иначе
			ИмяОбъекта.ТипОбъекта = ОпределитьТипОбъектаМетаданныхПоИмени(Результат[0]);
			ИмяОбъекта.НазваниеОбъекта = Результат[0];
			ИмяОбъекта.ИмяТабличнойЧасти = Результат[1];
		КонецЕсли;
	ИначеЕсли Результат.Количество() = 3 Тогда
		ИмяОбъекта.ТипОбъекта = Результат[0];
		ИмяОбъекта.НазваниеОбъекта = Результат[1];
		ИмяОбъекта.ИмяТабличнойЧасти = Результат[2];
	ИначеЕсли Результат.Количество() = 4 Тогда 
		ИмяОбъекта.ТипОбъекта = Результат[0];
		ИмяОбъекта.НазваниеОбъекта = Результат[1];
		ИмяОбъекта.ИмяТабличнойЧасти = Результат[3];
	ИначеЕсли Результат.Количество() = 1 Тогда
		ИмяОбъекта.ТипОбъекта = ОпределитьТипОбъектаМетаданныхПоИмени(Результат[0]);
		ИмяОбъекта.НазваниеОбъекта = Результат[0];
	КонецЕсли;
	
	Возврат ИмяОбъекта;
	
КонецФункции

Функция ОпределитьТипОбъектаМетаданныхПоИмени(Имя)
	Для каждого Объект Из Метаданные.Справочники Цикл 
		Если Объект.Имя = Имя Тогда 
			Возврат "Справочник";
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Объект Из Метаданные.Документы Цикл 
		Если Объект.Имя = Имя Тогда 
			Возврат "Документ";
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Объект Из Метаданные.Обработки Цикл 
		Если Объект.Имя = Имя Тогда 
			Возврат "Обработка";
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти

#Область Страница2

Функция ПолучитьАдресВоВременномХранилище()
	
	ТаблицаЗначенийРезультат = РеквизитФормыВЗначение("ТаблицаРезультат"); 
	
	СтруктураСтатистики = Новый Структура;
	СтруктураСтатистики.Вставить("columns", ТаблицаЗначенийРезультат.Колонки.Количество());
	СтруктураСтатистики.Вставить("rows", ТаблицаЗначенийРезультат.Количество());    
	
	ЗаписьЖурналаРегистрации("ЗагрузкаДанныхИзТаблиц", УровеньЖурналаРегистрации.Информация, , КоннекторHTTPВызовСервера.ОбъектВJson(СтруктураСтатистики),);
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаЗначенийРезультат, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции // ПолучитьАдресВоВременномХранилище()

&НаСервере
Процедура ЗаполнитьГруппировкуНеуникальных()
	ТаблицаОбхода.Очистить();
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТаблицаНеуникальных.НомерСтроки КАК НомерСтроки,
	               |	ТаблицаНеуникальных.НомерКолонки КАК НомерКолонки
	               |ПОМЕСТИТЬ Вт
	               |ИЗ
	               |	&ТаблицаНеуникальных КАК ТаблицаНеуникальных
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Вт.НомерСтроки КАК НомерСтроки,
	               |	Вт.НомерКолонки КАК НомерКолонки
	               |ИЗ
	               |	Вт КАК Вт
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Вт.НомерСтроки,
	               |	Вт.НомерКолонки";
	
	Запрос.УстановитьПараметр("ТаблицаНеуникальных", ТаблицаНеуникальных.Выгрузить());
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаОбхода.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Асинх Процедура Выгрузить(Команда)
	Если НЕ ИгнорироватьДубли Тогда
		Если ТаблицаНеуникальных.Количество() > 0 Тогда
			ЗаполнитьГруппировкуНеуникальных();
			Если УчитыватьВсеДубли Тогда
				ЗаполнитьНеуникальныеВТаблицуРезультат();
			Иначе
				Для каждого Строка Из ТаблицаОбхода Цикл
					Элементы.ШаблонСДанными.ТекущаяОбласть = ШаблонСДанными.Область(Строка.НомерСтроки, Строка.НомерКолонки, Строка.НомерСтроки, Строка.НомерКолонки);
					
					Неуникальные = ПолучитьСписокНеуникальныхДляЯчейки(Строка.НомерСтроки, Строка.НомерКолонки);
					Обещание = ВыбратьИзСпискаАсинх(Неуникальные);
					Результат = Ждать Обещание;
					Если Результат <> Неопределено Тогда
						ЗаполнитьЗначениеВТаблицеРезультат(Строка.НомерСтроки, Строка.НомерКолонки, Результат.Значение, Неуникальные);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АдресВременногоХранилищаТаблицы", ПолучитьАдресВоВременномХранилище());
	СтруктураПараметров.Вставить("ПутьКФайлу", ПутьКФайлу);
	Для каждого ЗначениеСписка Из СписокДополнительныхРеквизитов Цикл
		СтруктураПараметров.Вставить(ЗначениеСписка.Значение, Этаформа[ЗначениеСписка.Значение]);
	КонецЦикла;
	Закрыть(СтруктураПараметров);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура НайтиЗначенияКолонки(НомерКолонки, ЗагружаемыеДанные)
	
	ТипКодаЧисло = Ложь;
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Позиция", НомерКолонки);
	НайденныеСтроки = ИнформацияПоКолонкам.НайтиСтроки(СтруктураПоиска);
	ИнформацияОТекущейКолонке = НайденныеСтроки[0];
	ИнформацияПоТипу = ИнформацияОТекущейКолонке.ПоЧемуИскать;  //СписокЗначений в котором индекс элемента является приоритетом для поиска 
	Если ЗначениеЗаполнено(ИнформацияПоТипу) и ИнформацияПоТипу.Количество() = 1 и ИнформацияПоТипу.НайтиПоЗначению("КодЧисло") <> Неопределено тогда
		НайденЭлемент = ИнформацияПоТипу.НайтиПоЗначению("КодЧисло"); 
		ИндексЭлемента = ИнформацияПоТипу.Индекс(НайденЭлемент); 
		ИнформацияПоТипу[ИндексЭлемента].Значение = "Код";
		ИнформацияОТекущейКолонке.ТипКодаКолонкиЧисло = Истина;	
		ТипКодаЧисло = Истина;
	ИначеЕсли ИнформацияОТекущейКолонке.ТипКодаКолонкиЧисло = Истина тогда
		ТипКодаЧисло = Истина;
	КонецЕсли;
	ТипКолонки = ИнформацияОТекущейКолонке.ТипКолонки.Типы()[0];
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипКолонки).ПолноеИмя();
	ИмяОбъекта = ИнформацияОТекущейКолонке.ИмяКолонки;
	
	ТаблицаЗначенийПоиска = Новый ТаблицаЗначений;
	ТаблицаЗначенийПоиска.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийПоиска.Колонки.Добавить("ЗначениеПоискаЧисло", Новый ОписаниеТипов("Число"));
	ТаблицаЗначенийПоиска.Колонки.Добавить("ЗначениеПоискаСтрока", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(1000))); 
	
	НайденныеСтрокиДопКолонкиДляОтбора = ТаблицаДопКолонокДляПоиска.НайтиСтроки(Новый Структура("ИмяКолонки", ИмяОбъекта));
	КоличествоНайденныхСтрокДопКолонкиДляОтбора = НайденныеСтрокиДопКолонкиДляОтбора.Количество();
	Для Счетчик = 0 По КоличествоНайденныхСтрокДопКолонкиДляОтбора - 1 Цикл
		ТаблицаЗначенийПоиска.Колонки.Добавить("ДопЗначениеПоискаСтрока" + Счетчик, 
			ЗагружаемыеДанные.Колонки[НайденныеСтрокиДопКолонкиДляОтбора[Счетчик].ПолеПоиска].ТипЗначения);
	КонецЦикла;
	
	КонецТаблицы = ШаблонСДанными.ВысотаТаблицы;
	СтрокаНачало = 2;
	ТекСтрока = СтрокаНачало;
	ШагПоиска = 2000;
	НомерШага = 1;
	ВставкаГДЕ = "";
	МассивВставокГДЕ = новый Массив;
	НайденныеСтрокиГде = ТаблицаСтатичныхРеквизитовПоиска.НайтиСтроки(новый структура("ИмяКолонки", ИмяОбъекта));
	СтруктураПараметровГДЕ = Новый Структура;
	Для каждого СтрокаГде Из НайденныеСтрокиГде Цикл
		МассивВставокГде.Добавить("Т." + СтрокаГде.ПолеПоиска + "=&"+ СтрокаГде.ПолеПоиска);
		СтруктураПараметровГДЕ.Вставить(СтрокаГде.ПолеПоиска, СтрокаГде.ЗначениеРеквизита);
	КонецЦикла;
	
	МассивВставокДопКолонокДляОтбора = Новый Массив;
	Для Счетчик = 0 По КоличествоНайденныхСтрокДопКолонкиДляОтбора - 1 Цикл
		СтрокаДопКолонкаДляПоиска = НайденныеСтрокиДопКолонкиДляОтбора[Счетчик];
		МассивВставокДопКолонокДляОтбора.Добавить(
			" И Т." + СтрокаДопКолонкаДляПоиска.ПолеПоиска
				+ " = ВТТаблицаЗначенийПоиска.ДопЗначениеПоискаСтрока" + Счетчик + " ");
	КонецЦикла;

	Пока СтрокаНачало <= КонецТаблицы Цикл
		ТаблицаЗначенийПоиска.Очистить();
		СтрокаКонец = ШагПоиска * НомерШага;
		
		Если СтрокаКонец > КонецТаблицы Тогда
			СтрокаКонец = КонецТаблицы;
		КонецЕсли;
		
		Для Счетчик = СтрокаНачало По СтрокаКонец Цикл
			ТекСтрока = Счетчик;
			Ячейка = ШаблонСДанными.Область(ТекСтрока, НомерКолонки, ТекСтрока, НомерКолонки);
			Если ЗначениеЗаполнено(Ячейка.Текст) Тогда
				НоваяСтрокаПоиска = ТаблицаЗначенийПоиска.Добавить();
				НоваяСтрокаПоиска.НомерСтроки = ТекСтрока;
				Если ТипКодаЧисло = Истина и СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Ячейка.Текст, , Ложь) тогда
					НоваяСтрокаПоиска.ЗначениеПоискаЧисло = Число(Ячейка.Текст);    //нет применения этой строки в запросе, видимо хотели придумать - не придумали. Роняет запрос при передаче значения "214212E300"
				Иначе
					НоваяСтрокаПоиска.ЗначениеПоискаСтрока = Ячейка.Текст;     //Сравнение идет именно по этому полю, числа преобразуются отдельно как примитивные типы	
				КонецЕсли; 
				Для Счетчик1 = 0 По КоличествоНайденныхСтрокДопКолонкиДляОтбора - 1 Цикл
					СтрокаДопКолонкаДляПоиска = НайденныеСтрокиДопКолонкиДляОтбора[Счетчик1];
					СтрокаДанных = ЗагружаемыеДанные[ТекСтрока - 2];
					НоваяСтрокаПоиска["ДопЗначениеПоискаСтрока" + Счетчик1] = СтрокаДанных[СтрокаДопКолонкаДляПоиска.ПолеПоиска];
				КонецЦикла;	
			Иначе
				СтрокаНеНайденные = ТаблицаНеНайденных.Добавить();
				СтрокаНеНайденные.НомерСтроки = ТекСтрока;
				СтрокаНеНайденные.НомерКолонки = НомерКолонки;
				СтрокаНеНайденные.ТипКолонки = ОбъектМетаданных;
			КонецЕсли;
		КонецЦикла;
		
		НомерШага = НомерШага + 1;
		СтрокаНачало = СтрокаКонец + 1;
		
		Если ИнформацияПоТипу.Количество() > 0 Тогда
			
			МассивВставок = Новый Массив;
			Для сч = 0 по ИнформацияПоТипу.Количество() - 1 Цикл
				
				МассивВставокГдеСИключениями = Новый Массив;
				НайденныеСтрокиИсключаемыхЗначений = ТаблицаИсключенийЗначений.НайтиСтроки(Новый Структура("ИмяКолонки", ИмяОбъекта));
				Для Каждого СтрокаСИсключаемымиЗначениями Из НайденныеСтрокиИсключаемыхЗначений Цикл
					МассивИсключений = Новый Массив;
					Для Каждого ЭлементСписка Из СтрокаСИсключаемымиЗначениями.СписокИсключаемыхЗначений Цикл
						МассивИсключений.Добавить(ЭлементСписка.Значение);
					КонецЦикла;
					МассивВставокГдеСИключениями.Добавить("НЕ Т." + ИнформацияПоТипу[Сч] + " В (&МассивИсключений" + ИнформацияПоТипу[Сч] + ")");
					СтруктураПараметровГДЕ.Вставить("МассивИсключений" + ИнформацияПоТипу[Сч], МассивИсключений);
				КонецЦикла;
				
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВставокГдеСИключениями, МассивВставокГде, Истина);
				
				Если МассивВставокГдеСИключениями.Количество() > 0 Тогда
					ВставкаГДЕ = " ГДЕ " + стрСоединить(МассивВставокГдеСИключениями, " И ");
				КонецЕсли;
				
				ВставкаДопКолонокДляОтбора = СтрСоединить(МассивВставокДопКолонокДляОтбора, " ");
				СчСтрока = Формат(сч, "ЧН=0; ЧГ=");
				СтрокаЗапросаМассиваВставок = "
				|ВЫБРАТЬ
				|	ВТТаблицаЗначенийПоиска.НомерСтроки,
				|	Т.Ссылка,
				|	""" + ИнформацияПоТипу[сч] + ?(сч = 0, """ КАК ПоЧемуИщем,", """,") + "
				|	" + СчСтрока + ?(сч = 0, " КАК Приоритет", "") + "
				|" + ?(сч = 0, " ПОМЕСТИТЬ ВТНайденныеЭлементы", "") + "
				|ИЗ
				|	ВТТаблицаЗначенийПоиска КАК ВТТаблицаЗначенийПоиска
				|		ЛЕВОЕ СОЕДИНЕНИЕ " + ОбъектМетаданных + " КАК Т
				|		ПО ВТТаблицаЗначенийПоиска.ЗначениеПоискаСтрока = Т." + ИнформацияПоТипу[Сч].Значение
				+ ВставкаДопКолонокДляОтбора + ВставкаГДЕ;
				
				Если ТипКодаЧисло = Истина и СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Ячейка.Текст, , Ложь) тогда
					 СтрокаЗапросаМассиваВставок = СтрЗаменить(СтрокаЗапросаМассиваВставок,"ВТТаблицаЗначенийПоиска.ЗначениеПоискаСтрока", "ВТТаблицаЗначенийПоиска.ЗначениеПоискаЧисло");
				КонецЕсли;	
					
				МассивВставок.Добавить(СтрокаЗапросаМассиваВставок);
			КонецЦикла;
			
				
			ВставкаВЗапрос = СтрСоединить(МассивВставок, "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|");
		Иначе      //Если ничего не передали пытаемся найти по Наименованию
			ВставкаВЗАпрос = " ВЫБРАТЬ
			|	ВТТаблицаЗначенийПоиска.НомерСтроки КАК НомерСтроки,
			|	Т.Ссылка КАК Ссылка,
			|	""Наименование"" КАК ПоЧемуИщем,
			|	1 КАК Приоритет
			|ПОМЕСТИТЬ ВТНайденныеЭлементы
			|ИЗ
			|	ВТТаблицаЗначенийПоиска КАК ВТТаблицаЗначенийПоиска
			|		ЛЕВОЕ СОЕДИНЕНИЕ " + ОбъектМетаданных + " КАК Т
			|		ПО ВТТаблицаЗначенийПоиска.ЗначениеПоискаСтрока = Т.Наименование "
		КонецЕсли;
		
		ТекстЗапросаВТТаблицаЗначенийПоиска =
		"ВЫБРАТЬ
		|	т.НомерСтроки КАК НомерСтроки,
		|	т.ЗначениеПоискаЧисло КАК ЗначениеПоискаЧисло,
		|	т.ЗначениеПоискаСтрока КАК ЗначениеПоискаСтрока
		|ПОМЕСТИТЬ ВТТаблицаЗначенийПоиска
		|ИЗ
		|	&ТаблицаЗначенийПоиска КАК т;";
		
		МассивВставкиДопПолей = Новый Массив;
		Для Счетчик = 4 По ТаблицаЗначенийПоиска.Колонки.Количество() Цикл
			ИмяПоля = ТаблицаЗначенийПоиска.Колонки.Получить(Счетчик - 1).Имя;
			МассивВставкиДопПолей.Добавить("
			|, " + ИмяПоля + " КАК " + ИмяПоля);
		КонецЦикла;
		ВставкаДопПолей = СтрСоединить(МассивВставкиДопПолей, " ");
		ТекстЗапросаВТТаблицаЗначенийПоиска = СтрЗаменить(ТекстЗапросаВТТаблицаЗначенийПоиска,
			"КАК ЗначениеПоискаСтрока", "КАК ЗначениеПоискаСтрока" + ВставкаДопПолей);
		
		Запрос = Новый Запрос;
		ТекстЗапроса = ТекстЗапросаВТТаблицаЗначенийПоиска 
		+ ВставкаВЗапрос + " ;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
		|	МИНИМУМ(ВложенныйЗапрос.Приоритет) КАК Приоритет
		|ПОМЕСТИТЬ ВТСтрокиСУникальнымиЗначениями
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТНайденныеЭлементы.НомерСтроки КАК НомерСтроки,
		|		ВТНайденныеЭлементы.Приоритет КАК Приоритет
		|	ИЗ
		|		ВТНайденныеЭлементы КАК ВТНайденныеЭлементы
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТНайденныеЭлементы.НомерСтроки,
		|		ВТНайденныеЭлементы.Приоритет
		|	
		|	ИМЕЮЩИЕ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТНайденныеЭлементы.Ссылка) = 1) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНайденныеЭлементы.НомерСтроки КАК НомерСтроки,
		|	ВТНайденныеЭлементы.Ссылка КАК Ссылка,
		|	ВТНайденныеЭлементы.ПоЧемуИщем КАК ПоЧемуИщем,
		|	ВТНайденныеЭлементы.Приоритет КАК Приоритет Поместить ВтУникальные
		|ИЗ
		|	ВТНайденныеЭлементы КАК ВТНайденныеЭлементы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтрокиСУникальнымиЗначениями КАК ВТСтрокиСУникальнымиЗначениями
		|		ПО (ВТСтрокиСУникальнымиЗначениями.НомерСтроки = ВТНайденныеЭлементы.НомерСтроки)
		|			И (ВТСтрокиСУникальнымиЗначениями.Приоритет = ВТНайденныеЭлементы.Приоритет)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНайденныеЭлементы.НомерСтроки КАК НомерСтроки,
		|	ВТНайденныеЭлементы.Ссылка КАК Ссылка Поместить ВтНеуникальные
		|ИЗ
		|	ВТНайденныеЭлементы КАК ВТНайденныеЭлементы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтрокиСУникальнымиЗначениями КАК ВТСтрокиСУникальнымиЗначениями
		|		ПО (ВТСтрокиСУникальнымиЗначениями.НомерСтроки = ВТНайденныеЭлементы.НомерСтроки)
		|			И (ВТСтрокиСУникальнымиЗначениями.Приоритет = ВТНайденныеЭлементы.Приоритет)
		|ГДЕ
		|	ВТСтрокиСУникальнымиЗначениями.НомерСтроки ЕСТЬ NULL 
		|	И НЕ ВТНайденныеЭлементы.Ссылка ЕСТЬ NULL Сгруппировать По ВТНайденныеЭлементы.Ссылка, ВТНайденныеЭлементы.НомерСтроки;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТаблицаЗначенийПоиска.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВТТаблицаЗначенийПоиска КАК ВТТаблицаЗначенийПоиска
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУникальные КАК ВтУникальные
		|		ПО (ВТТаблицаЗначенийПоиска.НомерСтроки = ВтУникальные.НомерСтроки)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтНеуникальные КАК ВтНеуникальные
		|		ПО (ВТТаблицаЗначенийПоиска.НомерСтроки = ВтНеуникальные.НомерСтроки)
		|ГДЕ
		|	ВтУникальные.Ссылка ЕСТЬ NULL И ВтНеуникальные.Ссылка Есть Null 
		|	Сгруппировать По ВТТаблицаЗначенийПоиска.НомерСтроки Упорядочить По ВТТаблицаЗначенийПоиска.НомерСтроки";
		
		Запрос.УстановитьПараметр("ТаблицаЗначенийПоиска", ТаблицаЗначенийПоиска);
		Запрос.Установитьпараметр("НомерКолонки", НомерКолонки);
		Для каждого ПараметрГде Из СтруктураПараметровГДЕ Цикл
			Запрос.УстановитьПараметр(ПараметрГде.Ключ, ПараметрГде.Значение);
		КонецЦикла;
		
		Запрос.Текст = ТекстЗапроса;
		
		Результаты = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
		РезультатНайденные = Результаты[3];
		
		ВыборкаЗапроса = РезультатНайденные.Выбрать();
		Пока ВыборкаЗапроса.Следующий() Цикл
			СтрокаТаблицыРезультата = ЗагружаемыеДанные[ВыборкаЗапроса.НомерСтроки - 2];
			СтрокаТаблицыРезультата[ИмяОбъекта] = ВыборкаЗапроса.Ссылка;
			СтрокаТаблицыРезультата.Идентификатор = ВыборкаЗапроса.НомерСтроки;
		КонецЦикла;
		
		РезультатыНеуникальныеЗначения = Результаты[4];
		ВыборкаЗапроса = РезультатыНеуникальныеЗначения.Выбрать();
		
		Пока ВыборкаЗапроса.Следующий() Цикл 
			СтрокаНеуникальных = ТаблицаНеуникальных.Добавить();
			СтрокаНеуникальных.НомерСтроки = ВыборкаЗапроса.НомерСтроки;
			СтрокаНеуникальных.Ссылка = ВыборкаЗапроса.Ссылка;
			СтрокаНеуникальных.НомерКолонки = НомерКолонки;
			
			Если ТаблицаНеуникальных.Количество() > 5000000 Тогда
				ОбщегоНазначения.СообщитьПользователю("Очень много неуникальныйх значений...");
				Прервать;
			КонецЕсли;
		КонецЦикла;
		РезультатНеНайденные = Результаты[5];
		ВыборкаЗапроса = РезультатНеНайденные.Выбрать();
		Пока ВыборкаЗапроса.Следующий() Цикл
			СтрокаНеНайденные = ТаблицаНеНайденных.Добавить();
			СтрокаНеНайденные.НомерСтроки = ВыборкаЗапроса.НомерСтроки;
			СтрокаНеНайденные.НомерКолонки = НомерКолонки;
			СтрокаНеНайденные.ТипКолонки = ОбъектМетаданных;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура НайтиЗначенияКолонокОдногоТипа(МассивНомеровКолонок, ЗагружаемыеДанные)
	
	МассивВставокВЗапрос = Новый Массив;
	МассивЗначениеПоискаСтрока = Новый Массив;
	СтруктураПараметровГДЕ = Новый Структура;
	Для каждого НомерКолонки Из МассивНомеровКолонок Цикл
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Позиция", НомерКолонки);
		НайденныеСтроки = ИнформацияПоКолонкам.НайтиСтроки(СтруктураПоиска);
		ИнформацияОТекущейКолонке = НайденныеСтроки[0];
		ИнформацияПоТипу = ИнформацияОТекущейКолонке.ПоЧемуИскать;  //СписокЗначений в котором индекс элемента является приоритетом для поиска
		ТипКолонки = ИнформацияОТекущейКолонке.ТипКолонки.Типы()[0];
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипКолонки).ПолноеИмя();
		ИмяОбъекта = ИнформацияОТекущейКолонке.ИмяКолонки;
		Если ИнформацияПоТипу.Количество() > 0 Тогда
			
			МассивВставокГДЕ = новый Массив;
			НайденныеСтрокиГде = ТаблицаСтатичныхРеквизитовПоиска.НайтиСтроки(новый структура("ИмяКолонки", ИмяОбъекта));
			Для каждого СтрокаГде Из НайденныеСтрокиГде Цикл
				МассивВставокГде.Добавить("Т." + СтрокаГде.ПолеПоиска + "=&"+ СтрокаГде.ПолеПоиска);
				СтруктураПараметровГДЕ.Вставить(СтрокаГде.ПолеПоиска, СтрокаГде.ЗначениеРеквизита);
			КонецЦикла;
			
			МассивВставок = Новый Массив;
			Если МассивВставокГде.Количество() > 0 Тогда
				ВставкаГДЕ = " ГДЕ " + стрСоединить(МассивВставокГДЕ, " И ");
			КонецЕсли;
			
			Для сч = 0 по ИнформацияПоТипу.Количество() - 1 Цикл
				МассивВставокГдеСИключениями = Новый Массив;
				НайденныеСтрокиИсключаемыхЗначений = ТаблицаИсключенийЗначений.НайтиСтроки(Новый Структура("ИмяКолонки", ИмяОбъекта));
				Для Каждого СтрокаСИсключаемымиЗначениями Из НайденныеСтрокиИсключаемыхЗначений Цикл
					МассивИсключений = Новый Массив;
					Для Каждого ЭлементСписка Из СтрокаСИсключаемымиЗначениями.СписокИсключаемыхЗначений Цикл
						МассивИсключений.Добавить(ЭлементСписка.Значение);
					КонецЦикла;
					МассивВставокГдеСИключениями.Добавить("НЕ Т." + ИнформацияПоТипу[Сч] + " В (&МассивИсключений" + ИнформацияПоТипу[Сч] + ")");
					СтруктураПараметровГДЕ.Вставить("МассивИсключений" + ИнформацияПоТипу[Сч], МассивИсключений);
				КонецЦикла;
				
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВставокГдеСИключениями, МассивВставокГде, Истина);
				
				Если МассивВставокГдеСИключениями.Количество() > 0 Тогда
					ВставкаГДЕ = " ГДЕ " + стрСоединить(МассивВставокГдеСИключениями, " И ");
				КонецЕсли;
				
				СчСтрока = Формат(сч, "ЧН=0; ЧГ=");
				МассивВставок.Добавить("
				|ВЫБРАТЬ
				|	ВТТаблицаЗначенийПоиска.НомерСтроки,
				|	Т.Ссылка,
				|	""" + ИнформацияПоТипу[сч] + ?(сч = 0, """ КАК ПоЧемуИщем,", """,") + "
				|	" + СчСтрока + ?(сч = 0, " КАК Приоритет", "") + "
				|" + ?(сч = 0, " ПОМЕСТИТЬ ВТНайденныеЭлементы" + НомерКолонки, "") + "
				|ИЗ
				|	ВТТаблицаЗначенийПоиска КАК ВТТаблицаЗначенийПоиска
				|		ЛЕВОЕ СОЕДИНЕНИЕ " + ОбъектМетаданных + " КАК Т
				|		ПО ВТТаблицаЗначенийПоиска.ЗначениеПоискаСтрока" + НомерКолонки + " = Т." + ИнформацияПоТипу[Сч].Значение + ВставкаГДЕ);
			КонецЦикла;
			
			ВставкаВЗапрос = СтрСоединить(МассивВставок, "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|");
		Иначе      //Если ничего не передали пытаемся найти по Наименованию
			ВставкаВЗАпрос = " ВЫБРАТЬ
			|	ВТТаблицаЗначенийПоиска.НомерСтроки КАК НомерСтроки,
			|	Т.Ссылка КАК Ссылка,
			|	""Наименование"" КАК ПоЧемуИщем,
			|	1 КАК Приоритет
			|ПОМЕСТИТЬ ВТНайденныеЭлементы" + НомерКолонки +"
			|ИЗ
			|	ВТТаблицаЗначенийПоиска КАК ВТТаблицаЗначенийПоиска
			|		ЛЕВОЕ СОЕДИНЕНИЕ " + ОбъектМетаданных + " КАК Т
			|		ПО ВТТаблицаЗначенийПоиска.ЗначениеПоискаСтрока" + НомерКолонки + " = Т.Наименование "
		КонецЕсли;
		
		МассивЗначениеПоискаСтрока.Добавить("	т.ЗначениеПоискаСтрока" + НомерКолонки + " КАК ЗначениеПоискаСтрока" + НомерКолонки);
		МассивВставокВЗапрос.Добавить(ВставкаВЗапрос);
	КонецЦикла;
	
	МассивТекстов = Новый Массив;
	МассивТекстов.Добавить(" Выбрать т.Ссылка, т.НомерСтроки, т.Приоритет, т.ПоЧемуИщем
		| Поместить ВтНайденныеЭлементы
		| Из
		|	ВтНайденныеЭлементы" + МассивНомеровКолонок[0] +" Как т");
	Для сч = 1 По МассивНомеровКолонок.Количество() - 1 Цикл
		МассивТекстов.Добавить(" внутреннее соединение ВтНайденныеЭлементы" + МассивНомеровКолонок[сч] + " Как т" + МассивНомеровКолонок[сч] + "
		|		По т.НомерСтроки = т" + МассивНомеровКолонок[сч] + ".НомерСтроки И т.Ссылка = т" + МассивНомеровКолонок[сч] + ".Ссылка ");
	КонецЦикла;
	Текст = СтрСоединить(МассивТекстов, " ");
	МассивВставокВЗапрос.Добавить(Текст);
	
	ВставкаВт = СтрСоединить(МассивВставокВЗапрос, " ; 
	|
	| ");
	
	ТаблицаЗначенийПоиска = Новый ТаблицаЗначений;
	ТаблицаЗначенийПоиска.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	Для каждого НомерКолонки Из МассивНомеровКолонок Цикл	
		ТаблицаЗначенийПоиска.Колонки.Добавить("ЗначениеПоискаСтрока" + НомерКолонки, Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(1000)));
	КонецЦикла;
	
	КонецТаблицы = ШаблонСДанными.ВысотаТаблицы;
	СтрокаНачало = 2;
	ТекСтрока = СтрокаНачало;
	ШагПоиска = 2000;
	НомерШага = 1;
	ВставкаГДЕ = "";
	

	
	Пока СтрокаНачало <= КонецТаблицы Цикл
		ТаблицаЗначенийПоиска.Очистить();
		СтрокаКонец = ШагПоиска * НомерШага;
		
		Если СтрокаКонец > КонецТаблицы Тогда
			СтрокаКонец = КонецТаблицы;
		КонецЕсли;
		
		Для Счетчик = СтрокаНачало По СтрокаКонец Цикл
			ТекСтрока = Счетчик;
			НоваяСтрокаПоиска = ТаблицаЗначенийПоиска.Добавить();
			НоваяСтрокаПоиска.НомерСтроки = ТекСтрока;
			Для каждого НомерКолонки Из МассивНомеровКолонок Цикл
				Ячейка = ШаблонСДанными.Область(ТекСтрока, НомерКолонки, ТекСтрока, НомерКолонки);
				НоваяСтрокаПоиска["ЗначениеПоискаСтрока" + НомерКолонки] = Ячейка.Текст;
			КонецЦикла;

		КонецЦикла;
		
		НомерШага = НомерШага + 1;
		СтрокаНачало = СтрокаКонец + 1;
		
		
		ВставкаЗначенияПоискаСтрока = СтрСоединить(МассивЗначениеПоискаСтрока, ", ");
		
		Запрос = Новый Запрос;
		ТекстЗапроса = "ВЫБРАТЬ
		|	т.НомерСтроки КАК НомерСтроки, " + 
		ВставкаЗначенияПоискаСтрока + 
		" ПОМЕСТИТЬ ВТТаблицаЗначенийПоиска
		|ИЗ
		|	&ТаблицаЗначенийПоиска КАК т;" 
		+ ВставкаВт + " ;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
		|	МИНИМУМ(ВложенныйЗапрос.Приоритет) КАК Приоритет
		|ПОМЕСТИТЬ ВТСтрокиСУникальнымиЗначениями
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТНайденныеЭлементы.НомерСтроки КАК НомерСтроки,
		|		ВТНайденныеЭлементы.Приоритет КАК Приоритет
		|	ИЗ
		|		ВТНайденныеЭлементы КАК ВТНайденныеЭлементы
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТНайденныеЭлементы.НомерСтроки,
		|		ВТНайденныеЭлементы.Приоритет
		|	
		|	ИМЕЮЩИЕ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТНайденныеЭлементы.Ссылка) = 1) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНайденныеЭлементы.НомерСтроки КАК НомерСтроки,
		|	ВТНайденныеЭлементы.Ссылка КАК Ссылка,
		|	ВТНайденныеЭлементы.ПоЧемуИщем КАК ПоЧемуИщем,
		|	ВТНайденныеЭлементы.Приоритет КАК Приоритет Поместить ВтУникальные
		|ИЗ
		|	ВТНайденныеЭлементы КАК ВТНайденныеЭлементы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтрокиСУникальнымиЗначениями КАК ВТСтрокиСУникальнымиЗначениями
		|		ПО (ВТСтрокиСУникальнымиЗначениями.НомерСтроки = ВТНайденныеЭлементы.НомерСтроки)
		|			И (ВТСтрокиСУникальнымиЗначениями.Приоритет = ВТНайденныеЭлементы.Приоритет)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНайденныеЭлементы.НомерСтроки КАК НомерСтроки,
		|	ВТНайденныеЭлементы.Ссылка КАК Ссылка Поместить ВтНеуникальные
		|ИЗ
		|	ВТНайденныеЭлементы КАК ВТНайденныеЭлементы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтрокиСУникальнымиЗначениями КАК ВТСтрокиСУникальнымиЗначениями
		|		ПО (ВТСтрокиСУникальнымиЗначениями.НомерСтроки = ВТНайденныеЭлементы.НомерСтроки)
		|			И (ВТСтрокиСУникальнымиЗначениями.Приоритет = ВТНайденныеЭлементы.Приоритет)
		|ГДЕ
		|	ВТСтрокиСУникальнымиЗначениями.НомерСтроки ЕСТЬ NULL 
		|	И НЕ ВТНайденныеЭлементы.Ссылка ЕСТЬ NULL Сгруппировать По ВТНайденныеЭлементы.Ссылка, ВТНайденныеЭлементы.НомерСтроки;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТаблицаЗначенийПоиска.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВТТаблицаЗначенийПоиска КАК ВТТаблицаЗначенийПоиска
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтУникальные КАК ВтУникальные
		|		ПО (ВТТаблицаЗначенийПоиска.НомерСтроки = ВтУникальные.НомерСтроки)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтНеуникальные КАК ВтНеуникальные
		|		ПО (ВТТаблицаЗначенийПоиска.НомерСтроки = ВтНеуникальные.НомерСтроки)
		|ГДЕ
		|	ВтУникальные.Ссылка ЕСТЬ NULL И ВтНеуникальные.Ссылка Есть Null 
		|	Сгруппировать По ВТТаблицаЗначенийПоиска.НомерСтроки Упорядочить По ВТТаблицаЗначенийПоиска.НомерСтроки";
		
		Запрос.УстановитьПараметр("ТаблицаЗначенийПоиска", ТаблицаЗначенийПоиска);
		Запрос.Установитьпараметр("НомерКолонки", НомерКолонки);
		Для каждого ПараметрГде Из СтруктураПараметровГДЕ Цикл
			Запрос.УстановитьПараметр(ПараметрГде.Ключ, ПараметрГде.Значение);
		КонецЦикла;
		
		Запрос.Текст = ТекстЗапроса;
		
		Результаты = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
		РезультатНайденные = Результаты[3 + МассивНомеровКолонок.Количество()];
		
		ВыборкаЗапроса = РезультатНайденные.Выбрать();
		Пока ВыборкаЗапроса.Следующий() Цикл
			СтрокаТаблицыРезультата = ЗагружаемыеДанные[ВыборкаЗапроса.НомерСтроки - 2];
			СтрокаТаблицыРезультата[ИмяОбъекта] = ВыборкаЗапроса.Ссылка;
			СтрокаТаблицыРезультата.Идентификатор = ВыборкаЗапроса.НомерСтроки;
		КонецЦикла;
		
		РезультатыНеуникальныеЗначения = Результаты[4 + МассивНомеровКолонок.Количество()];
		ВыборкаЗапроса = РезультатыНеуникальныеЗначения.Выбрать();
		
		Пока ВыборкаЗапроса.Следующий() Цикл 
			СтрокаНеуникальных = ТаблицаНеуникальных.Добавить();
			СтрокаНеуникальных.НомерСтроки = ВыборкаЗапроса.НомерСтроки;
			СтрокаНеуникальных.Ссылка = ВыборкаЗапроса.Ссылка;
			СтрокаНеуникальных.НомерКолонки = НомерКолонки;
			
			Если ТаблицаНеуникальных.Количество() > 5000000 Тогда
				ОбщегоНазначения.СообщитьПользователю("Очень много неуникальныйх значений...");
				Прервать;
			КонецЕсли;
		КонецЦикла;
		РезультатНеНайденные = Результаты[5 + МассивНомеровКолонок.Количество()];
		ВыборкаЗапроса = РезультатНеНайденные.Выбрать();
		Пока ВыборкаЗапроса.Следующий() Цикл
			СтрокаНеНайденные = ТаблицаНеНайденных.Добавить();
			СтрокаНеНайденные.НомерСтроки = ВыборкаЗапроса.НомерСтроки;
			СтрокаНеНайденные.НомерКолонки = НомерКолонки;
			СтрокаНеНайденные.ТипКолонки = ОбъектМетаданных;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьСписокНеуникальныхДляЯчейки(НомерСтроки, Колонка)
	СтруктураПоиска = Новый Структура("НомерСтроки, НомерКолонки", НомерСтроки, Колонка);
	НайденныеСтроки = ТаблицаНеуникальных.НайтиСтроки(СтруктураПоиска);
	Результат = Новый СписокЗначений;
	Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		Результат.Добавить(НайденнаяСтрока.Ссылка);
	КонецЦикла;
	Результат.Добавить("Добавить все");
	Возврат Результат;
КонецФункции 

&НаКлиенте
Асинх Процедура ПодобратьНеуникальные(Команда)
	Для каждого Область Из Элементы.ШаблонСДанными.ПолучитьВыделенныеОбласти() Цикл
		НомерСтроки = Область.Низ;
		НомерКолонки = Область.Лево;
		
		Неуникальные = ПолучитьСписокНеуникальныхДляЯчейки(НомерСтроки, НомерКолонки);
		
		Обещание = ВыбратьИзСпискаАсинх(Неуникальные);
		Результат = Ждать Обещание;
		Если Результат <> Неопределено Тогда
			ЗаполнитьЗначениеВТаблицеРезультат(НомерСтроки, НомерКолонки, Результат.Значение, Неуникальные);
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКолонкуЭлементарногоТипа(НайденнаяКолонка, ЗагружаемыеДанные, КэшЗначенийКолонки)
	
	Для Сч = 2 По ШаблонСДанными.ВысотаТаблицы Цикл
		СтрокаТаблицы = ЗагружаемыеДанные[сч - 2];
		Ячейка = ШаблонСДанными.Область(Сч, НайденнаяКолонка.Позиция, Сч, НайденнаяКолонка.Позиция);
		СтрокаТаблицы[НайденнаяКолонка.ИмяКолонки] = НайтиВКэшеИлиРаспознатьЭлементарныйТип(Ячейка.Текст, НайденнаяКолонка.ТипКолонки, КэшЗначенийКолонки);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПоказатьНеуникальные()
	Для каждого СтрокаНеуникальных Из ТаблицаНеуникальных Цикл
		ЯчейкаМакета = ШаблонСДанными.Область(СтрокаНеуникальных.НомерСтроки, СтрокаНеуникальных.НомерКолонки, СтрокаНеуникальных.НомерСтроки, СтрокаНеуникальных.НомерКолонки);
		ЯчейкаМакета.ЦветФона = WebЦвета.ЛососьСветлый;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначениеВТаблицеРезультат(НомерСтроки, НомерКолонки, Результат, СписокЗаполнения = Неопределено)
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Позиция", НомерКолонки);
	НайденныеСтрокиПоискаОдного = ТаблицаКолонокПоискаОдного.НайтиСтроки(СтруктураПоиска);
	НайденныеСтроки = ИнформацияПоКолонкам.НайтиСтроки(СтруктураПоиска);
	ИнформацияОТекущейКолонке = НайденныеСтроки[0];
	СтрокаТаблицы = ТаблицаРезультат[НомерСтроки - 2];
	Если Результат = "Добавить все" Тогда
		Флаг = Ложь;
		Для каждого ЗначениеЗаполнения Из СписокЗаполнения Цикл
			Если Не ЗначениеЗаполнения.Значение = "Добавить все" Тогда
				Если НайденныеСтрокиПоискаОдного.Количество() = 1 Тогда
					КолонкаЗаполнения = НайденныеСтрокиПоискаОдного[0].ИмяКолонки;
				Иначе
					КолонкаЗаполнения = ?(СтрокаТаблицы.Свойство(ИнформацияОТекущейКолонке.ПредставлениеКолонки), ИнформацияОТекущейКолонке.ПредставлениеКолонки, ИнформацияОТекущейКолонке.имяКолонки);
				КонецЕсли;
				Если не флаг Тогда
					СтрокаТаблицы[КолонкаЗаполнения] = ЗначениеЗаполнения.Значение;
					Флаг = Истина;
				Иначе
					НоваяСтрока = ТаблицаРезультат.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
					НоваяСтрока[КолонкаЗаполнения] = ЗначениеЗаполнения.Значение;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если НайденныеСтрокиПоискаОдного.Количество() = 1 Тогда
			КолонкаЗаполнения = НайденныеСтрокиПоискаОдного[0].ИмяКолонки;
		Иначе
			КолонкаЗаполнения = ?(СтрокаТаблицы.Свойство(ИнформацияОТекущейКолонке.ПредставлениеКолонки), ИнформацияОТекущейКолонке.ПредставлениеКолонки, ИнформацияОТекущейКолонке.имяКолонки);
		КонецЕсли;
		СтрокаТаблицы[КолонкаЗаполнения] = Результат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтработатьПеречисление(ОписаниеОбъекта, НайденнаяКолонка, ЗагружаемыеДанные)
	ИмяКолонки = НайденнаяКолонка.ИмяКолонки;
	Для сч = 2 По ШаблонСДанными.ВысотаТаблицы Цикл
		Ячейка = ШаблонСДанными.Область(Сч, НайденнаяКолонка.Позиция, Сч, НайденнаяКолонка.Позиция);
		ЗначениеЯчейки = Ячейка.Текст;
		Для каждого ЗначениеПеречисления Из Перечисления[ОписаниеОбъекта.НазваниеОбъекта] Цикл 
			Если Строка(ЗначениеПеречисления) = СокрЛП(ЗначениеЯчейки) Тогда 
				СтрокаТаблицыРезультата = ЗагружаемыеДанные[Сч - 2];
				СтрокаТаблицыРезультата[ИмяКолонки] = ЗначениеПеречисления;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Асинх Процедура УдалитьПустыеСтроки(Команда)
	Если НЕ СтрокиУдалены Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.РаспознанныеДанные;
		ЗначПропустить = "Пропустить";
		ЗначУдалить = "Удалить строку";
		ЗначУдалитьВсе = "Удалить все нераспознанные";
		ЗначОтмена = "Отмена";
		Отмена = Ложь;
		ПредыдущаяСтрока = 0;
		
		
		СписокКнопок = Новый СписокЗначений; 
		СписокКнопок.Добавить(ЗначПропустить);
		СписокКнопок.Добавить(ЗначУдалить);
		СписокКнопок.Добавить(ЗначУдалитьВсе);
		СписокКнопок.Добавить(ЗначОтмена);
		Для каждого НенайденнаяСтрока Из ТаблицаНеНайденных Цикл
			ТекущаяСтрока = НенайденнаяСтрока.НомерСтроки;
			Если ТекущаяСтрока = ПредыдущаяСтрока Тогда
				Продолжить;
			КонецЕсли;
			Элементы.ТаблицаРезультат.ТекущаяСтрока = ТаблицаРезультат[НенайденнаяСтрока.НомерСтроки - 2].ПолучитьИдентификатор();
			Обещание = ВопросАсинх("Удалить строку из распознанных данных?", СписокКнопок,, ЗначУдалитьВсе);
			Результат = Ждать Обещание;
			Если Результат = ЗначОтмена Тогда
				Отмена = Истина;
				Прервать;
			КонецЕсли;
			Если Результат = ЗначПропустить Тогда
				ТаблицаРезультат[НенайденнаяСтрока.НомерСтроки - 2].ПометкаУдаления = Ложь;
			ИначеЕсли Результат = ЗначУдалить Тогда 
				ТаблицаРезультат[НенайденнаяСтрока.НомерСтроки - 2].ПометкаУдаления = Истина;
			ИначеЕсли Результат = ЗначУдалитьВсе Тогда
				ЗаполнитьУдаляемыеСтрокиНаСервере();
				Прервать;
			КонецЕсли;
			ПредыдущаяСтрока = ТекущаяСтрока;
		КонецЦикла;
		Если НЕ Отмена Тогда
			УдалитьСтрокиРезультата();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПрисоединитьНаСервере(ТабличныйДокумент, НомерСтроки)
	ВысотаДок = ТабличныйДокумент.ВысотаТаблицы;
	ОбластьПриемник = ТабличныйДокумент.Область(ВысотаДок + 1, 1, ВысотаДок + 1, 1);
	СтрокаМакета = ШаблонСДанными.Область(НомерСтроки, 1, НомерСтроки, ШаблонСДанными.ШиринаТаблицы);
	ТабличныйДокумент.ВставитьОбласть(СтрокаМакета, ОбластьПриемник);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУдаляемыеСтрокиНаСервере()
	ПредыдущаяСтрока = 0;
	Для каждого НенайденнаяСтрока Из ТаблицаНеНайденных Цикл
		ТекущаяСтрока = НенайденнаяСтрока.НомерСтроки;
		Если ТекущаяСтрока = ПредыдущаяСтрока Тогда
			Продолжить;
		КонецЕсли;
		ТаблицаРезультат[НенайденнаяСтрока.НомерСтроки - 2].ПометкаУдаления = Истина;
		ПредыдущаяСтрока = ТекущаяСтрока;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокиРезультата()
	НайденныеСтроки = ТаблицаРезультат.НайтиСтроки(Новый Структура("ПометкаУдаления", Истина));
	Для каждого Строка Из НайденныеСтроки Цикл
		ТаблицаРезультат.Удалить(Строка);
	КонецЦикла;
	СтрокиУдалены = Истина;
КонецПроцедуры

&НаСервере
Процедура ПоказатьНенайденные()
	ПредыдущаяСтрока = 0;           //To do примечание
	Для каждого СтрокаНеНайденных Из ТаблицаНенайденных Цикл
		ЯчейкаМакета = ШаблонСДанными.Область(СтрокаНеНайденных.НомерСтроки, СтрокаНеНайденных.НомерКолонки, СтрокаНеНайденных.НомерСтроки, СтрокаНеНайденных.НомерКолонки);
		ЯчейкаМакета.ЦветФона = WebЦвета.БледноЗолотистый;
		ЯчейкаМакета.Примечание.Текст = "Не удалось найти объект " + СтрокаНеНайденных.ТипКолонки;
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ВыгрузитьНераспознанныВДокументНаСервере()
	ПредыдущаяСтрока = 0;
	ТабДок = Новый ТабличныйДокумент;
	СтрокаШапки = ШаблонСДанными.Область(1, 1, 1, ШаблонСДанными.ШиринаТаблицы);
	ОбластьШапки = Табдок.Область(1,1,1,1);
	ТабДок.ВставитьОбласть(СтрокаШапки, ОбластьШапки);
	СчСтрока = 1;
	Для каждого НенайденнаяСтрока Из ТаблицаНеНайденных Цикл
		ТекущаяСтрока = НенайденнаяСтрока.НомерСтроки;
		Если ТекущаяСтрока = ПредыдущаяСтрока Тогда
			Продолжить;
		КонецЕсли;
		СчСтрока = СчСтрока + 1;
		ОбластьПриемник = Табдок.Область(СчСтрока, 1, СчСтрока, 1);
		ТабДок.ВставитьОбласть(ШаблонСДанными.Область(НенайденнаяСтрока.НомерСтроки, 1, НенайденнаяСтрока.НомерСтроки, ШаблонСДанными.ШиринаТаблицы), ОбластьПриемник);
		ПредыдущаяСтрока = ТекущаяСтрока;
	КонецЦикла;
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьНераспознанныВДокумент(Команда)
	ТабДок = ВыгрузитьНераспознанныВДокументНаСервере();
	Идентификатор = Строка(ЭтаФорма.УникальныйИдентификатор);
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(Идентификатор);
	ОписаниеПечатнойФормы = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, Идентификатор);
	ОписаниеПечатнойФормы.ТабличныйДокумент = ТабДок;
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,,ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура СвернутьМножествоЗагрузитьВРезультат(ЗагружаемыеДанные)
	
	МассивНаименований = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаКолонокПоискаОдного, "ИмяКолонки", Истина);
	ТаблицаРезультат.Загрузить(ЗагружаемыеДанные);
	Запрос = Новый Запрос;
	
	Для каждого Наименование Из МассивНаименований Цикл
		МассивВставокЧ1 = Новый Массив;
		МассивВставокЧ2 = Новый Массив;
		МассивПовторяющихсяКолонок = ТаблицаКолонокПоискаОдного.НайтиСтроки(Новый структура("ИмяКолонки", Наименование)); 
		Флаг = Истина;
		Для каждого Стр Из МассивПовторяющихсяКолонок Цикл
			ИнформацияОТекущейКолонке = ИнформацияПоКолонкам.НайтиСтроки(Новый Структура("Позиция", Стр.Позиция))[0];
			
			ТипКолонки = ИнформацияОТекущейКолонке.ТипКолонки.Типы()[0];
			ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипКолонки).ПолноеИмя();
			ИмяКолонки = ИнформацияОТекущейКолонке.ИмяКолонки;
			МассивВставокЧ1.Добавить(" ЗагружаемыеДанные." + ИмяКолонки + " КАК " + ИмяКолонки);
			МассивВставокЧ2.Добавить(" т." + ИмяКолонки + ?(флаг," Как Данные", "") + ", т.Ид как ИД Из ВтЗагружаемыеДанные КАК т ");
			Флаг = Ложь;
			НомерКолонки = Стр.Позиция;
		КонецЦикла;
		ВставкаВЗапрос1 = СтрСоединить(МассивВставокЧ1, ", ");
		ВставкаВЗапрос2 = СтрСоединить(МассивВставокЧ2, " Объединить все Выбрать ");
		
		
		ТекстЗапроса = "ВЫБРАТЬ ЗагружаемыеДанные.Идентификатор как ИД, " + ВставкаВЗапрос1 + " Поместить ВтЗагружаемыеДанные
		|ИЗ
		|	&ЗагружаемыеДанные КАК ЗагружаемыеДанные Где ЗагружаемыеДанные.Идентификатор <> 0; 
		|/////////
		|Выбрать ВлЗагружаемыеДанные.Ид, ВлЗагружаемыеДанные.Данные как Данные Поместить ВтГруппировка 
		|Из (Выбрать " + ВставкаВЗапрос2 + ") как ВлЗагружаемыеДанные 
		|	Где ВлЗагружаемыеДанные.Данные <> Значение(" + ОбъектМетаданных + ".ПустаяСсылка) Сгруппировать По ВлЗагружаемыеДанные.Ид, ВлЗагружаемыеДанные.Данные;
		|//////
		|Выбрать ВтЗагружаемыеДанные.ИД, isNull(ВтГруппировка.Данные, Значение(" + ОбъектМетаданных + ".ПустаяСсылка)) как Данные Поместить ВтИтогГруппировки 
		|Из ВтЗагружаемыеДанные как ВтЗагружаемыеДанные Левое Соединение ВтГруппировка как ВтГруппировка по ВтЗагружаемыеДанные.ИД = ВтГруппировка.ИД ;
		|//////////
		|Выбрать Вл.Ид, Вл.Данные Поместить ВтУникальные Из (Выбрать т.Ид, т.Данные из ВтИтогГруппировки как т Сгруппировать по т.ИД, т.Данные Имеющие Количество (РАЗЛИЧНЫЕ т.Данные) = 1 ) как Вл Сгруппировать по Вл.ИД, Вл.Данные; 
		|/////////
		| Выбрать ВтИтогГруппировки.Ид Как ИД Из ВтИтогГруппировки как ВтИтогГруппировки Левое соединение ВтУникальные как втУникальные По ВтИтогГруппировки.Ид = ВтУникальные.Ид Где ВтУникальные.Ид Есть Null"
		;
		
		
		Запрос.УстановитьПараметр("ЗагружаемыеДанные", ЗагружаемыеДанные);
		Запрос.Текст = ТекстЗапроса;
		
		МассивРезультат = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
		РезультатУникальные = МассивРезультат[МассивРезультат.Количество()-2];
		ВыборкаУникальные = РезультатУникальные.Выбрать();
		
		Пока ВыборкаУникальные.Следующий() Цикл
			ТаблицаРезультат[ВыборкаУникальные.ИД -2][Наименование] = ВыборкаУникальные.Данные;
		КонецЦикла;
		
		РезультатНЕУникальные = МассивРезультат[МассивРезультат.Количество()-1];
		ВыборкаНеУникальные = РезультатНЕУникальные.Выбрать();
		
		Пока ВыборкаНеУникальные.Следующий() Цикл
			НоваяСтрокаНеуникальных = ТаблицаНеуникальных.Добавить();
			НоваяСтрокаНеуникальных.НомерСтроки = ВыборкаНеУникальные.Ид;
			НоваяСтрокаНеуникальных.Ссылка = ВыборкаНеУникальные.Данные;
			НоваяСтрокаНеуникальных.НомерКолонки = НомерКолонки;
		КонецЦикла;
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНеуникальныеВТаблицуРезультат()
	Для каждого Строка Из ТаблицаОбхода Цикл
		Элементы.ШаблонСДанными.ТекущаяОбласть = ШаблонСДанными.Область(Строка.НомерСтроки, Строка.НомерКолонки, Строка.НомерСтроки, Строка.НомерКолонки);
		
		Неуникальные = ПолучитьСписокНеуникальныхДляЯчейки(Строка.НомерСтроки, Строка.НомерКолонки);
		ЗаполнитьЗначениеВТаблицеРезультат(Строка.НомерСтроки, Строка.НомерКолонки, "Добавить все", Неуникальные);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ВыгрузитьДублиВДокументНаСервере()
	ПредыдущаяСтрока = 0;
	ТабДок = Новый ТабличныйДокумент;
	СтрокаШапки = ШаблонСДанными.Область(1, 1, 1, ШаблонСДанными.ШиринаТаблицы);
	ОбластьШапки = Табдок.Область(1,1,1,1);
	ТабДок.ВставитьОбласть(СтрокаШапки, ОбластьШапки);
	СчСтрока = 1;
	ТаблицаНеуникальных.Сортировать("НомерСтроки");
	Для каждого НеуникальнаяСтрока Из ТаблицаНеуникальных Цикл
		ТекущаяСтрока = НеуникальнаяСтрока.НомерСтроки;
		Если ТекущаяСтрока = ПредыдущаяСтрока Тогда
			Продолжить;
		КонецЕсли;
		СчСтрока = СчСтрока + 1;
		ОбластьПриемник = Табдок.Область(СчСтрока, 1, СчСтрока, 1);
		ТабДок.ВставитьОбласть(ШаблонСДанными.Область(НеуникальнаяСтрока.НомерСтроки, 1, НеуникальнаяСтрока.НомерСтроки, ШаблонСДанными.ШиринаТаблицы), ОбластьПриемник);
		ПредыдущаяСтрока = ТекущаяСтрока;
	КонецЦикла;
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьДублиВДокумент(Команда)
	ТабДок = ВыгрузитьДублиВДокументНаСервере();
	Идентификатор = Строка(ЭтаФорма.УникальныйИдентификатор);
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(Идентификатор);
	ОписаниеПечатнойФормы = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, Идентификатор);
	ОписаниеПечатнойФормы.ТабличныйДокумент = ТабДок;
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,,ЭтаФорма);
	
КонецПроцедуры


