
&НаКлиенте
Процедура НачатьЗагрузку()
	СтруктураПараметров = Новый Структура;
	
	ОписаниеОповещенияВозврата = Новый ОписаниеОповещения("ЗагрузкаИзФайлаПосле", ЭтотОбъект); 
	
	СтруктураПараметров.Вставить("Заголовок", "Загрузка морозилок"""); 
	СтруктураПараметров.Вставить("Колонки", Новый Массив);
	
	СтруктураПараметров.Колонки.Добавить(Новый Структура("Имя, Тип, Представление, Примечание, ОбязательнаДляЗаполнения, ПоЧемуИскать", 
															"ИнвНом",
															Новый ОписаниеТипов("Строка"),
															"Инв. №",
															"Инв. №",
															Истина
														)
										);				 
	СтруктураПараметров.Колонки.Добавить(Новый Структура("Имя, Тип, Представление, Примечание, ОбязательнаДляЗаполнения", 
															"ЗавНом",
															Новый ОписаниеТипов("Строка"),
															"Зав. №",
															"Зав. №",
															Истина
														)
										);				 
	СтруктураПараметров.Колонки.Добавить(Новый Структура("Имя, Тип, Представление, Примечание, ОбязательнаДляЗаполнения", 
															"ТипМК",
															Новый ОписаниеТипов("Строка"),
															"Тип МК",
															"Тип МК",
															Истина
														)
										);				 
	СтруктураПараметров.Колонки.Добавить(Новый Структура("Имя, Тип, Представление, Примечание, ОбязательнаДляЗаполнения", 
															"залоговая",
															Новый ОписаниеТипов("Число"),
															"залоговая",
															"залоговая",
															Истина
														)
										);
										
	СтруктураПараметров.Колонки.Добавить(Новый Структура("Имя, Тип, Представление, Примечание, ОбязательнаДляЗаполнения", 
															"Год",
															Новый ОписаниеТипов("Дата"),
															"Год",
															"Год",
															Истина
														)
										);									
										
	ЗагрузкаДанныхИзТаблицКлиент.ОткрытьФормуЗагрузкиИзТаблиц(СтруктураПараметров, ЭтаФорма, ОписаниеОповещенияВозврата);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаИзФайлаПосле(СтруктураПараметров, ДополнительныеПараметры) Экспорт  
	
	Если ЗначениеЗаполнено(СтруктураПараметров) Тогда 
		Адрес = СтруктураПараметров.АдресВременногоХранилищаТаблицы; 
		ЗагрузитьТаблицуНаСервере(Адрес);  	
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура ЗагрузитьТаблицуНаСервере(Адрес) 

	ТаблицаКЗагрузке = ПолучитьИзВременногоХранилища(Адрес);  
	 
	Для каждого Строка из ТаблицаКЗагрузке цикл 
		НМорозилка = Справочники.Морозилки.СоздатьЭлемент();
		НМорозилка.Наименование = "Морозильная камера";
		НМорозилка.ТипМК = Строка.ТипМК;
		НМорозилка.ЗалоговаяСтоимость = Строка.Залоговая;
		НМорозилка.ИнвентарныйНомер = Строка.ИнвНом;
		НМорозилка.ЗаводскойНомер = Строка.ЗавНом;  
		НМорозилка.ДатаВыпуска = Строка.Год;  
		НМорозилка.Записать();
	КонецЦикла;
	
	Сообщить("Готово");

КонецПроцедуры  

&НаСервере
Процедура СоздатьПриходникНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Морозилки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Морозилки КАК Морозилки
		|ГДЕ
		|	НЕ Морозилки.ПометкаУдаления";
		
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(); 
	
	НДок = Документы.ДвижениеМорозилок.СоздатьДокумент(); 
	НДок.Дата = ТекущаяДата();
	НДок.ВидОперации = Перечисления.ВидОперацииМорозилок.ПриходОтПоставщика;    
	НДок.ОткудаТип = Перечисления.ТипМестаМорозилок.Поставщик;
	НДок.ОткудаОбъект = Справочники.Партнеры.НайтиПоКоду("00-00000352");
	НДок.КудаТип = Перечисления.ТипМестаМорозилок.НашСклад;   
	НДок.КудаОбъект = Справочники.Склады.НайтиПоНаименованию("Склад_1");
		
	Пока Выборка.Следующий() Цикл
		нСтр = НДок.Морозилки.Добавить();  
		нСтр.Морозилка = Выборка.Ссылка;
	КонецЦикла;        
	
	НДок.Записать(РежимЗаписиДокумента.Проведение);
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПриходник(Команда)
	СоздатьПриходникНаСервере();  
	Сообщить("Готово");
КонецПроцедуры


&НаКлиенте
Процедура СоздатьПередачу(Команда)
	
	СтруктураПараметров = Новый Структура;
	
	ОписаниеОповещенияВозврата = Новый ОписаниеОповещения("СоздатьПередачуПосле", ЭтотОбъект); 
	
	СтруктураПараметров.Вставить("Заголовок", "Загрузка морозилок"""); 
	СтруктураПараметров.Вставить("Колонки", Новый Массив); 
	
	СписокПоЧемуИскатьМорозилку = Новый СписокЗначений;
	СписокПоЧемуИскатьМорозилку.Добавить("ЗаводскойНомер");  
	
	СписокПоЧемуИскатьПартнера = Новый СписокЗначений;
	СписокПоЧемуИскатьПартнера.Добавить("Наименование");
	
	СтруктураПараметров.Колонки.Добавить(Новый Структура("Имя, Тип, Представление, Примечание, ОбязательнаДляЗаполнения, ПоЧемуИскать", 
															"ЗаводскойНомер",
															Новый ОписаниеТипов("СправочникСсылка.Морозилки"),
															"ЗаводскойНомер",
															"ЗаводскойНомер",
															Истина,
															СписокПоЧемуИскатьМорозилку
														)
										);				 
	СтруктураПараметров.Колонки.Добавить(Новый Структура("Имя, Тип, Представление, Примечание, ОбязательнаДляЗаполнения, ПоЧемуИскать", 
															"Партнер",
															Новый ОписаниеТипов("СправочникСсылка.Партнеры"),
															"Партнер",
															"Партнер",
															Истина,
															СписокПоЧемуИскатьПартнера
														)
										);				 
										
										
	ЗагрузкаДанныхИзТаблицКлиент.ОткрытьФормуЗагрузкиИзТаблиц(СтруктураПараметров, ЭтаФорма, ОписаниеОповещенияВозврата);

КонецПроцедуры   

&НаКлиенте
Процедура СоздатьПередачуПосле(СтруктураПараметров, ДополнительныеПараметры) Экспорт  
	
	Если ЗначениеЗаполнено(СтруктураПараметров) Тогда 
		Адрес = СтруктураПараметров.АдресВременногоХранилищаТаблицы; 
		СоздатьПередачиНаСервере(Адрес);  	
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура СоздатьПередачиНаСервере(Адрес) 
	
	
	ТаблицаКЗагрузке = ПолучитьИзВременногоХранилища(Адрес); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.ЗаводскойНомер КАК Морозилка,
		|	Т.Партнер КАК Партнер
		|ПОМЕСТИТЬ Вт
		|ИЗ
		|	&Т КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Вт.Морозилка КАК Морозилка,
		|	Вт.Партнер КАК Партнер
		|ИЗ
		|	Вт КАК Вт
		|ИТОГИ ПО
		|	Партнер";
	
	Запрос.УстановитьПараметр("Т", ТаблицаКЗагрузке);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаПартнер = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПартнер.Следующий() Цикл
		
		Выборка = ВыборкаПартнер.Выбрать();
		
		НДок = Документы.ДвижениеМорозилок.СоздатьДокумент(); 
		НДок.Дата = ТекущаяДата();
		НДок.ВидОперации = Перечисления.ВидОперацииМорозилок.ПередачаКлиенту;    
		НДок.ОткудаТип = Перечисления.ТипМестаМорозилок.НашСклад;
		НДок.ОткудаОбъект = Справочники.Склады.НайтиПоНаименованию("Склад_1");
		НДок.КудаТип = Перечисления.ТипМестаМорозилок.Контрагент;   
		НДок.КудаОбъект = ВыборкаПартнер.Партнер;
		
		Пока Выборка.Следующий() Цикл
			нСтр = НДок.Морозилки.Добавить();  
			нСтр.Морозилка = Выборка.Морозилка;
		КонецЦикла;        
		
		НДок.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
	Сообщить("Готово");

КонецПроцедуры  




