
&НаКлиенте
Процедура ОбновитьСписок()
	Если Не ЗначениеЗаполнено(ЗонаДоставки) Тогда
		Сообщить("Выберите зону доставки.");
		Возврат;
	КонецЕсли;
	
	НужныеЗаказыКлиента();
		
КонецПроцедуры

&НаСервере
Процедура НужныеЗаказыКлиента()
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК ЗаказКлиентаДок
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.ЗонаДоставки = &Зона
	|	И ЗаказКлиента.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.ЗаказКлиентаДок КАК Заказ,
	|	ИСТИНА КАК ВыборДокументов
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс.Заказы КАК РейсЗаказы
	|		ПО ВТ_Заказы.ЗаказКлиентаДок = РейсЗаказы.ЗаказКлиента
	|			И (НЕ РейсЗаказы.Ссылка.ПометкаУдаления)
	|ГДЕ
	|	РейсЗаказы.Ссылка ЕСТЬ NULL";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Зона", ЗонаДоставки);
	
	Результат = Запрос.Выполнить();
	
	ТЗ = Результат.Выгрузить();
	
	Кандидаты.Загрузить(ТЗ);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРейс(Команда)
	// Собираем выбранные заказы
	Если Кандидаты.Количество() = 0 Тогда
		Сообщить("Не документов из чего делать рейс.");
		Возврат;
	КонецЕсли;
	
	МассивЗаказов = Новый Массив;
	Для Каждого Стр Из Кандидаты Цикл
		Если Стр.ВыборДокументов = Истина Тогда
			МассивЗаказов.Добавить(Стр.Заказ);
		КонецЕсли;
	КонецЦикла;
	Если МассивЗаказов.Количество() = 0 Тогда
		Сообщить("Не выбрано ни одного заказа.");
		Возврат;
	КонецЕсли;
	
	СсылкаРейса = СоздатьРейсПоставки(ЗонаДоставки, МассивЗаказов);
	
	// Очищаем список (чтобы не нажали второй раз) и открываем форму рейса
	Кандидаты.Очистить();
	Элементы.Кандидаты.Обновить();
	
	ОткрытьФорму("Документ.Рейс.ФормаОбъекта", Новый Структура("Ключ", СсылкаРейса));
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьРейсПоставки(ЗонаДоставки, МассивЗаказов) Экспорт
	
	Рейс = Документы.Рейс.СоздатьДокумент();
	Рейс.Дата = ТекущаяДата();
	Рейс.ЗонаДоставки = ЗонаДоставки;
	Если ТипЗнч(ПараметрыСеанса.ТекущийПользователь) = Тип("СправочникСсылка.Пользователи") Тогда
		Рейс.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Для Каждого ЗК Из МассивЗаказов Цикл
		СтрТЧ = Рейс.Заказы.Добавить();
		СтрТЧ.ЗаказКлиента = ЗК;
	КонецЦикла;
	
	Рейс.Записать();
	Возврат Рейс.Ссылка;
КонецФункции


&НаКлиенте
Процедура ЗонаДоставкиПриИзменении(Элемент)
	ОбновитьСписок();
КонецПроцедуры
